{"layout":"article.njk","title":"Bevy 0.11 released","date":"2023-07-09T03:00:00.000Z","formattedDate":"2023-7-9","source_link":"https://bevyengine.org/news/bevy-0-11","tags":["rust"],"topics":[{"name":"Rust","slug":"rust"}],"content":"<p>Bevy, a refreshingly simple data-driven game engine built in Rust, has announced the release of version 0.11 on crates.io. With the help of 166 contributors, 522 pull requests, community reviewers, and generous sponsors, Bevy continues to evolve as a powerful tool for game development. The new release brings a host of new features, bug fixes, and quality of life tweaks.</p>\n<p>One of the highlights of Bevy 0.11 is the addition of Screen Space Ambient Occlusion (SSAO) support. This feature enhances the visual quality of scenes by estimating how much surrounding geometry blocks incoming light. Additionally, Bevy now supports Temporal Anti-Aliasing (TAA), which smooths out aliasing artifacts in the image by blending newly rendered frames with past frames.</p>\n<p>Bevy&#39;s anti-aliasing options also include MSAA and FXAA. Each method has its own advantages and disadvantages, and Bevy 0.11 marks TAA as an experimental feature due to its tradeoffs and reliance on heuristics.</p>\n<p>Developers can explore these new features and improvements in Bevy&#39;s improved anti-aliasing example. Bevy Assets also offers a collection of community-developed plugins, games, and learning resources.</p>\n<p>To update existing Bevy apps or plugins to version 0.11, developers can refer to the 0.10 to 0.11 Migration Guide. Bevy&#39;s full source code is available on GitHub, ensuring its status as a free and open-source game engine.</p>\n<p>Bevy&#39;s platform support currently includes Vulkan, DirectX12, and Metal, with WebGPU support planned for the future. However, WebGL support is unlikely due to the absence of compute shaders.</p>\n<p>The Bevy team extends special thanks to Intel for their open-source XeGTAO project, which greatly contributed to the development of the Screen Space Ambient Occlusion feature.</p>\n<p>With Bevy 0.11, developers have access to a more robust and feature-rich game engine that simplifies the development process while delivering impressive visual results.</p>\n"}