{"layout":"article.njk","title":"Govulncheck v1.0.0 is released!","date":"2023-07-12T03:00:00.000Z","formattedDate":"2023-7-12","source_link":"https://go.dev/blog/govulncheck","tags":["go"],"topics":[{"name":"Go","slug":"go"}],"content":"<p>The Go security team has announced the release of govulncheck v1.0.0, along with v1.0.0 of the API for integrating scanning into other tools. This release marks an important milestone in Go&#39;s support for vulnerability management, which was first announced in September.</p>\n<p>Govulncheck is a command-line tool that helps Go users find known vulnerabilities in their project dependencies. It can analyze both codebases and binaries, prioritizing vulnerabilities in functions that your code is actually calling. To install the latest version of govulncheck, you can use the command <code>go install</code>.</p>\n<p>Once installed, you can run govulncheck inside your module to scan for vulnerabilities. The tool is designed to reduce noise and provide accurate results. If you need more information on how to get started with govulncheck, you can refer to the govulncheck tutorial.</p>\n<p>In addition to the command-line tool, Go now offers a stable API for integrating security scanners and other tools with govulncheck. This API provides the same functionality as the command-line tool and can be found at <code>golang.org/x/vuln/scan</code>. An example of integration with the osv-scanner is provided as well.</p>\n<p>Govulncheck is powered by the Go vulnerability database, which can be accessed at <code>https://vuln.go.dev</code>. This database provides comprehensive information about known vulnerabilities in public Go modules. Go package maintainers are encouraged to contribute information about public vulnerabilities in their projects to improve the accuracy and coverage of the database.</p>\n<p>To browse the entries in the Go vulnerability database, you can visit <code>pkg.go.dev/vuln</code>. The database API has been updated to improve performance and ensure long-term extensibility. Go also provides an experimental tool to generate your own vulnerability database index.</p>\n<p>Vulnerability detection is now integrated into various tools that are commonly used by Go developers. The Go vulnerability database can be accessed on the search and package pages of <code>pkg.go.dev</code>. This allows developers to easily identify vulnerabilities in older versions of modules.</p>\n<p>With the release of govulncheck v1.0.0 and the stable API, Go developers now have powerful tools at their disposal to enhance the security of their projects. By leveraging govulncheck and the Go vulnerability database, developers can proactively identify and address vulnerabilities in their dependencies.</p>\n"}