{"layout":"article.njk","title":"Kotlin - The Great Kotlin Week: 1.9, Notebook, MongoDB Driver and support for education - JVM Weekly vol. 50","date":"2023-07-12T03:00:00.000Z","formattedDate":"2023-7-12","source_link":"https://vived.substack.com/p/the-great-kotlin-week-19-notebook","tags":["kotlin"],"topics":[{"name":"Kotlin","slug":"kotlin"}],"content":"<p>Last week was full of news related to Kotlin, and our latest edition is dedicated to this language. Let&#39;s dive into the highlights of The Great Kotlin Week.</p>\n<ol>\n<li>The release of Kotlin 1.9:\nThe biggest announcement is the release of Kotlin 1.9.0, which brings significant improvements to the new K2 compiler and introduces new features. The K2 compiler for the JVM has transitioned from alpha to beta, entering the final testing phase before Kotlin 2.0. Developers are encouraged to test their own builds. Note that when using the K2 compiler with the kapt annotation processor plugin, kapt will continue to use the old compiler (version 1.9) and disable some version compatibility checks.</li>\n</ol>\n<p>To experiment with the K2 compiler in your project, set Gradle properties <code>kotlin.experimental.tryK2=true</code>. </p>\n<ol start=\"2\">\n<li><p>Kotlin Notebook launch:\nFor those interested in Data Science, Kotlin Notebook is a new tool that integrates code, visualizations, and explanatory text in a single, interactive document. It provides a dynamic programming environment for instant code prototyping and real-time result observation. Kotlin Notebook is particularly useful for data mining tasks.</p>\n</li>\n<li><p>MongoDB Driver:\nKotlin now has official support for MongoDB with the release of the MongoDB Driver. This driver allows developers to interact with MongoDB databases using Kotlin&#39;s expressive and concise syntax. It provides a seamless integration between Kotlin and MongoDB, making it easier to build robust and scalable applications.</p>\n</li>\n<li><p>Support for education:\nThe Kotlin community is committed to supporting education. Various resources, such as tutorials, documentation, and learning materials, are available to help developers learn and master Kotlin. Additionally, Kotlin Playground now allows developers to test WebAssembly compilations online, providing a hands-on learning experience.</p>\n</li>\n</ol>\n<p>These updates in Kotlin 1.9, along with the introduction of Kotlin Notebook, the MongoDB Driver, and the continued support for education, demonstrate the language&#39;s commitment to enhancing developer productivity and expanding its ecosystem. Stay tuned for more exciting news in the world of Kotlin!</p>\n<p>Original article: <a href=\"https://jvmweekly.com/issues/50\">JVM Weekly vol. 50</a></p>\n"}