{"layout":"article.njk","title":"Rails Introduces picture_tag Helper for Responsive Image Support","date":"2023-07-12T03:00:00.000Z","formattedDate":"2023-7-12","source_link":"https://blog.saeloun.com/2023/07/12/picture-tag-rails/","tags":["ruby"],"topics":[{"name":"Ruby","slug":"ruby"}],"content":"<p>Rails has recently introduced a new helper called picture_tag, which aims to simplify the process of serving responsive images in modern web applications. As developers, we often face the challenge of supporting different devices with varying screen sizes and resolutions. Additionally, we need to optimize image loading and support different image formats for better performance.</p>\n<p>The picture_tag helper generates a <picture> tag with <source> and <img> tags, allowing us to provide different images for different screen sizes and orientations. This technique, known as Art Direction, enables us to serve cropped images for different layouts. For example, we can display a full scene image for desktop layouts and a zoomed-in image for mobile layouts.</p>\n<p>With the picture_tag helper, we can easily define a series of source tags with different srcset and media attributes, along with a fallback img tag. This ensures that the appropriate image is loaded based on the user&#39;s device and screen characteristics.</p>\n<p>Here&#39;s an example of how to use the srcset attribute with picture_tag:</p>\n<pre><code class=\"language-ruby\">&lt;%= picture_tag(&quot;image.jpg&quot;, srcset: { &quot;image@2x.jpg&quot; =&gt; &quot;2x&quot;, &quot;image@3x.jpg&quot; =&gt; &quot;3x&quot; }) %&gt;\n</code></pre>\n<p>In this example, the picture_tag helper generates a <picture> tag with two <source> tags, each specifying a different image and its corresponding density descriptor. The browser will then choose the appropriate image based on the device&#39;s pixel density.</p>\n<p>By leveraging the picture_tag helper, developers can improve the performance and user experience of their web applications by serving optimized images to different devices and browsers. Whether you&#39;re building a responsive website or a mobile app, the picture_tag helper in Rails is a valuable tool to have in your toolkit.</p>\n<p>Stay tuned for more updates on the latest features and improvements in the world of programming languages and frameworks.</p>\n"}