{"layout":"article.njk","title":"Introducing Mockery's New Packages Feature","date":"2023-07-10T03:00:00.000Z","formattedDate":"2023-7-10","source_link":"https://landontclipp.github.io/blog/2023/06/21/introducing-mockerys-new-packages-feature/","tags":["go"],"topics":[{"name":"Go","slug":"go"}],"content":"<p>vektra/mockery is a Go package that auto-generates mock implementations of interfaces in your project. The latest update to the code introduces a feature called packages, which offers significant benefits to developers.</p>\n<p>Previously, developers had to use go:generate directives in their code to tell mockery to generate mock implementations. This approach had several issues, including performance and inflexibility. However, with the new packages feature, the configuration model has been improved to align with Go&#39;s abstract syntax tree parsing. This change provides more flexibility and control over how mocks are generated.</p>\n<p>Using the packages feature, developers can specify the configurations in the configuration file, resulting in faster performance. In fact, the mockery project itself has seen a 5x increase in speed with the usage of packages. Additionally, the configuration options allow developers to have precise control over the generation of mocks.</p>\n<p>To demonstrate the usage of packages, let&#39;s consider an example with the Stringer interface. By specifying the configuration in the config file, developers can easily generate a mock for the Stringer interface. The generated mock file will be stored in a separate mocks folder.</p>\n<p>The packages feature in mockery is a game-changer for developers looking for faster and more flexible mock generation. It outperforms other mock generator packages, including the officially supported gomock project, in terms of speed and control. Developers can explore advanced examples and testimonials on the project&#39;s GitHub page.</p>\n<p>Useful links:</p>\n<ul>\n<li>Mockery documentation: <a href=\"https://github.com/vektra/mockery\">link</a></li>\n<li>Advanced examples and testimonials: <a href=\"https://github.com/vektra/mockery/discussions/549\">link</a></li>\n</ul>\n"}