{"layout":"article.njk","title":"\"WebKit Features in Safari 17 Beta: Keeping Up with the Latest Web Technologies\"","date":"2023-06-07T03:00:00.000Z","formattedDate":"2023-6-7","source_link":"https://webkit.org/blog/14205/news-from-wwdc23-webkit-features-in-safari-17-beta/","tags":["webkit","safari"],"topics":[{"name":"WebKit","slug":"webkit"},{"name":"Safari","slug":"safari"}],"content":"<p>This article was originally published on the WebKit blog.</p>\n<p>Apple&#39;s WebKit team has been busy this year, shipping eight Safari releases since WWDC22 with over 140 new web technologies in the first half of 2023 alone. Now, they&#39;re excited to announce another 88 web features coming this fall in Safari 17 beta.</p>\n<p>Here are some of the highlights:</p>\n<p>Web Apps\nWith macOS Sonoma, users can add any website to their Dock as a web app. This allows for easy access to frequently-used websites, separate from the rest of their browsing. Web apps work seamlessly with Stage Manager, Mission Control, and keyboard shortcuts like Command + Tab.</p>\n<p>Spatial Web\nSafari 17 beta introduces support for the Spatial Web, which allows for web content to be placed in the real world using augmented reality (AR) and virtual reality (VR) technologies. This opens up new possibilities for web developers to create immersive experiences for their users.</p>\n<p>Images and Video\nSafari 17 beta includes support for the AV1 Image File Format (AVIF), which provides high-quality images with smaller file sizes. It also includes support for WebP, an image format developed by Google. In addition, Safari 17 beta supports the WebCodecs API, which allows for encoding and decoding of video and audio in web applications.</p>\n<p>HTML, CSS, and JavaScript\nSafari 17 beta includes several new HTML, CSS, and JavaScript features, such as support for the :focus-visible pseudo-class, the CSS aspect-ratio property, and the new Intl.RelativeTimeFormat API.</p>\n<p>Web Developer Tools\nSafari 17 beta includes improvements to the Web Inspector, including a new Network Summary view, a new Accessibility panel, and improved performance. It also includes support for the new WebGPU API, which provides low-level access to graphics hardware for web developers.</p>\n<p>Security\nSafari 17 beta includes several security improvements, such as support for the SameSite=None attribute for cookies, which improves cross-site request forgery (CSRF) protection. It also includes support for the new Content Security Policy (CSP) level 3, which provides additional protections against cross-site scripting (XSS) attacks.</p>\n<p>WebKit API\nSafari 17 beta includes several new features in the WebKit API, such as support for WebAssembly SIMD, which allows for faster processing of data in web applications. It also includes support for the new WebTransport API, which provides a low-level API for bidirectional communication between web applications and servers.</p>\n<p>Browser Changes\nSafari 17 beta includes several changes to the browser itself, such as a new tab design, improved tab management, and improvements to the Reader view.</p>\n<p>Safari Extensions\nSafari 17 beta includes improvements to the Safari Extensions API, including support for the new WebExtensions API, which allows for easier porting of extensions from other browsers.</p>\n<p>Bug Fixes and More\nSafari 17 beta includes numerous bug fixes and performance improvements, as well as support for new web standards and technologies.</p>\n<p>Help Us Beta Test\nDevelopers can download the Safari Technology Preview to test their websites and web applications with the latest web technologies and features.</p>\n<p>Feedback\nThe WebKit team welcomes feedback from developers and users on the new features and improvements in Safari 17 beta. They encourage developers to file bug reports and feature requests on the WebKit bug tracker.</p>\n"}