{"layout":"article.njk","title":"Working with jOOQ and Flyway using Testcontainers","date":"2023-06-07T03:00:00.000Z","formattedDate":"2023-6-7","source_link":"https://testcontainers.com/guides/working-with-jooq-flyway-using-testcontainers/","tags":["jooq","flyway","testcontainers"],"topics":[{"name":"jOOQ","slug":"jooq"},{"name":"Flyway","slug":"flyway"},{"name":"Testcontainers","slug":"testcontainers"}],"content":"<p>In this guide, developers will learn how to create a Spring Boot project using jOOQ with Postgres and Flyway Database migrations. They will also configure testcontainers-jooq-codegen-maven-plugin to generate jOOQ code using Testcontainers and Flyway migration scripts. </p>\n<p>Prerequisites:</p>\n<ul>\n<li>Java 17+</li>\n<li>IDE (Intellij IDEA, Eclipse, NetBeans, VS Code)</li>\n<li>Docker environment supported by Testcontainers</li>\n</ul>\n<p>To start, developers will create their database tables using Flyway Database migrations. They will then configure jOOQ code generation using the Maven plugin. Next, they will implement their persistence layer repositories using jOOQ to manage Users, Posts, and other data. </p>\n<p>To test the jOOQ persistence layer, developers will use Testcontainers to run integration tests. They will write a repository test using the @JooqTest slice annotation and an integration test using the @SpringBootTest annotation. </p>\n<p>Finally, developers will learn how to fetch complex object trees using jOOQ and run tests to ensure everything is working correctly. </p>\n<p>This guide is a great resource for developers looking to work with jOOQ and Flyway using Testcontainers. By following the steps outlined in this guide, developers can create a robust and efficient persistence layer for their Spring Boot applications. </p>\n<p>Further Reading:</p>\n<ul>\n<li>Testcontainers documentation: <a href=\"https://www.testcontainers.org/\">https://www.testcontainers.org/</a></li>\n<li>jOOQ documentation: <a href=\"https://www.jooq.org/\">https://www.jooq.org/</a></li>\n<li>Flyway documentation: <a href=\"https://flywaydb.org/\">https://flywaydb.org/</a></li>\n</ul>\n"}