{"layout":"article.njk","title":"API Platform: The PHP Framework for Creating REST and GraphQL APIs","date":"2023-06-30T03:00:00.000Z","formattedDate":"2023-6-30","source_link":"https://api-platform.com","tags":["php","api-platform"],"topics":[{"name":"PHP","slug":"php"},{"name":"API Platform","slug":"api-platform"}],"content":"<p>API Platform, the popular PHP framework for building REST and GraphQL APIs, has just launched its new website. This framework is designed to simplify the process of creating web APIs, making it easier for developers to build robust and scalable applications.</p>\n<p>With API Platform, developers can define their API resources as PHP classes or by using OpenAPI. This allows for a flexible and customizable approach to building APIs. The framework also provides automatic documentation using OpenAPI, SwaggerUI, and GraphiQL, making it easier for developers to understand and interact with the API.</p>\n<p>One of the standout features of API Platform is its support for standards and formats such as JSON-LD, Hydra, and JSON:API. This ensures that developers can easily integrate their APIs with other systems and services.</p>\n<p>API Platform also offers native integration with popular persistence libraries, including PostgreSQL, MongoDB, ElasticSearch, SQLite, MySQL, MariaDB, SQL Server, and Oracle. This means that developers can seamlessly retrieve, persist, paginate, and validate data using their preferred database system.</p>\n<p>Furthermore, API Platform allows developers to customize every aspect of their API&#39;s behavior through carefully designed extension points. This level of customization ensures that developers can tailor their APIs to meet their specific requirements.</p>\n<p>To further simplify the development process, API Platform provides a client generator that scaffolds client applications. This feature allows developers to quickly create client apps that can interact with their APIs.</p>\n<p>Whether you&#39;re a developer looking to create a REST or GraphQL API, API Platform offers a comprehensive solution with its easy installation process, support for industry standards, and customizable features. Stay tuned to Dev Radar for more news and updates on API Platform and other programming languages and frameworks.</p>\n"}