{"layout":"article.njk","title":"CLI Library v2.1: A Powerful Tool for Interactive Command Line Interfaces","date":"2023-06-30T03:00:00.000Z","formattedDate":"2023-6-30","source_link":"https://github.com/daniele77/cli","tags":["c","cli","libraries","tools"],"topics":[{"name":"C++","slug":"c"},{"name":"CLI","slug":"cli"},{"name":"libraries","slug":"libraries"},{"name":"tools","slug":"tools"}],"content":"<p>The CLI Library v2.1 has just been released, offering developers a robust solution for building interactive command line interfaces in modern C++. This cross-platform, header-only library is designed in a Cisco style, making it easy to create intuitive and user-friendly command line applications.</p>\n<p>One of the key highlights of this release is the addition of new functionality, which has resulted in some breaking API changes. Developers who are currently using version 2.0 of the CLI Library will need to migrate their applications to the new version. The library provides detailed documentation and examples to assist with this transition.</p>\n<p>Key Features:</p>\n<ul>\n<li>Interactive command line interfaces in a Cisco style</li>\n<li>Support for async programming and schedulers</li>\n<li>Telnet server for remote sessions (requires asio library)</li>\n</ul>\n<p>Getting Started:\nTo include the CLI Library in your project, simply add the header files to your project&#39;s include path. The library has no dependencies unless you require remote sessions, in which case you will need to install either the standalone version or the boost version of the asio library.</p>\n<p>Code Example:</p>\n<pre><code class=\"language-cpp\">#include &lt;cli/cli.hpp&gt;\n\nint main() {\n  cli::App app;\n  \n  // Define your command line interface here\n  \n  return app.run();\n}\n</code></pre>\n<p>With the CLI Library v2.1, developers can easily create powerful and interactive command line interfaces for their applications. Whether you&#39;re building a command line tool, a network management application, or any other CLI-based software, this library provides the necessary tools and features to streamline your development process. Stay ahead of the curve with the latest updates and enhancements in the CLI Library.</p>\n"}