{"layout":"article.njk","title":"Style Child Components from Parent - Angular","date":"2023-07-11T03:00:00.000Z","formattedDate":"2023-7-11","source_link":"https://devsuhas.com/2023/07/09/style-child-components-from-parent-angular/","tags":["angular"],"topics":[{"name":"Angular","slug":"angular"}],"content":"<p>In this article, the author explores the topic of styling child components from the parent in Angular. By default, Angular restricts styles to each individual component, preventing inheritance from the parent component to its child. However, the author presents two methods to overcome this limitation.</p>\n<p>The first method is to use <code>ViewEncapsulation.None</code>, which removes the encapsulation of the component&#39;s styles. This allows the parent component to apply styles directly to the child component. However, it&#39;s important to note that this approach can cause conflicts if other components in the application have the same class names.</p>\n<p>The second method is to use the <code>::ng-deep</code> selector, which allows styles to be applied to child components. However, similar to <code>ViewEncapsulation.None</code>, this approach also has the risk of affecting other components with the same class names.</p>\n<p>To mitigate these risks, the author suggests using the <code>:host</code> selector, which scopes the style only to the respective component and its descendants. This ensures that the style remains contained and does not affect other components.</p>\n<p>Overall, this article provides developers with insights into different strategies for styling child components from the parent in Angular. By understanding these methods, developers can make informed decisions when it comes to styling their Angular applications.</p>\n<pre><code class=\"language-typescript\">// Example usage of ViewEncapsulation.None\n@Component({\n  selector: &#39;app-component&#39;,\n  templateUrl: &#39;app.component.html&#39;,\n  styleUrls: [&#39;app.component.scss&#39;],\n  encapsulation: ViewEncapsulation.None\n})\nexport class AppComponent { }\n\n// Example usage of ::ng-deep\n@Component({\n  selector: &#39;app-component&#39;,\n  templateUrl: &#39;app.component.html&#39;,\n  styleUrls: [&#39;app.component.scss&#39;]\n})\nexport class AppComponent { }\n\n// Example usage of :host\n@Component({\n  selector: &#39;app-component&#39;,\n  templateUrl: &#39;app.component.html&#39;,\n  styleUrls: [&#39;app.component.scss&#39;],\n  host: {\n    &#39;class&#39;: &#39;app-component&#39;\n  }\n})\nexport class AppComponent { }\n</code></pre>\n"}