{"layout":"article.njk","title":"Using Enum Attributes in Ruby on Rails","date":"2023-07-11T03:00:00.000Z","formattedDate":"2023-7-11","source_link":"https://www.honeybadger.io/blog/how-to-use-enum-attributes-in-ruby-on-rails/","tags":["ruby"],"topics":[{"name":"Ruby","slug":"ruby"}],"content":"<p>Dive into the world of enums to streamline your code and make it more readable in Ruby on Rails. Learn best practices, how to add and manage enum attributes, and take advantage of Rails&#39; built-in features to efficiently manage finite sets of values in your models.</p>\n<p>Enums, or enumerations, are a common way to represent options for an attribute of a model in Rails. Instead of using strings or creating additional tables, Rails allows you to represent these options as integers and automatically convert them to strings using built-in methods. This makes presenting options to users as strings while storing them as numbers straightforward and maintainable.</p>\n<p>In addition to simplifying data representation and storage, enums also come with useful utility methods. Rails automatically generates scope methods for each value, making it easy to query and filter records based on the enum attribute. It also generates methods for each enum value, allowing the code to easily check the current value of an enum attribute in a more readable and expressive manner. Enums are often leveraged in form helpers, making presenting options in a form straightforward.</p>\n<p>To add an enum attribute to an existing table in Rails, start by creating a new migration. For example, if you want to add an attribute &quot;status&quot; to the model &quot;course,&quot; you can run the following command:</p>\n<pre><code class=\"language-ruby\">rails generate migration AddStatusToCourses status:integer\n</code></pre>\n<p>If you want the attribute to have a default value, you can open the newly created migration in the <code>db/migrate</code> directory and edit the <code>add_column</code> method call to include the default value you want:</p>\n<pre><code class=\"language-ruby\">add_column :courses, :status, :integer, default: 0\n</code></pre>\n<p>To apply the migration to your database, run the following command:</p>\n<pre><code class=\"language-ruby\">rails db:migrate\n</code></pre>\n<p>Next, edit your model to declare the enum and its mappings of strings to integers:</p>\n<pre><code class=\"language-ruby\">class Course &lt; ApplicationRecord\n  enum status: { active: 0, archived: 1, draft: 2 }\nend\n</code></pre>\n<p>That&#39;s it! You&#39;ve added an attribute to your model and defined it as an enum. Now you can use the enum attribute in your application.</p>\n<p>If you don&#39;t already have a model to which you&#39;d like to add an enum, creating a new enum attribute is as easy as any other attribute. Simply generate a new model and define the enum attribute in the migration:</p>\n<pre><code class=\"language-ruby\">rails generate model Course name:string status:integer\n</code></pre>\n<p>Open up the generated migration and ensure it looks like this:</p>\n<pre><code class=\"language-ruby\">class CreateCourses &lt; ActiveRecord::Migration[6.0]\n  def change\n    create_table :courses do |t|\n      t.string :name\n      t.integer :status\n\n      t.timestamps\n    end\n  end\nend\n</code></pre>\n<p>Finally, run the migration to create the new table:</p>\n<pre><code class=\"language-ruby\">rails db:migrate\n</code></pre>\n<p>Now you have a new table with an enum attribute ready to be used in your Rails application. Enums provide a powerful and efficient way to manage finite sets of values, making your code more readable and maintainable.</p>\n"}