{"layout":"article.njk","title":"Shifty 3.0: The Fastest TypeScript Animation Engine on the Web","date":"2023-07-03T03:00:00.000Z","formattedDate":"2023-7-3","source_link":"https://github.com/jeremyckahn/shifty/releases/tag/3.0.0","tags":["typescript","shifty"],"topics":[{"name":"TypeScript","slug":"typescript"},{"name":"Shifty","slug":"shifty"}],"content":"<p>Shifty, the popular TypeScript animation engine, has released its highly anticipated version 3.0. This new version brings exciting updates and improvements for developers looking to create smooth and performant animations on the web.</p>\n<p>One of the key highlights of Shifty 3.0 is the updated documentation site, which can be found at <code>https://jeremyckahn.github.io/shifty/doc/</code>. The documentation provides comprehensive guides, examples, and API references, making it easier for developers to get started with Shifty and explore its advanced features.</p>\n<p>In terms of breaking changes, the release notes mention some important updates. Developers are advised to review these changes to ensure a smooth transition when updating their projects to Shifty 3.0.</p>\n<p>Shifty has gained popularity among developers for its simplicity and speed. It offers a wide range of easing functions, supports multiple animation types, and provides excellent performance even with complex animations. With the latest release, Shifty continues to be a reliable choice for developers seeking a powerful animation engine for their TypeScript projects.</p>\n<p>To demonstrate the capabilities of Shifty, here&#39;s an example of how to create a simple animation using the library:</p>\n<pre><code class=\"language-typescript\">import { tween } from &#39;shifty&#39;;\n\nconst element = document.getElementById(&#39;myElement&#39;);\n\ntween({\n  from: { opacity: 0 },\n  to: { opacity: 1 },\n  duration: 1000,\n  easing: &#39;easeInOutQuad&#39;,\n  step: (state) =&gt; {\n    element.style.opacity = state.opacity.toString();\n  },\n});\n</code></pre>\n<p>In conclusion, Shifty 3.0 brings exciting updates and improvements to the fastest TypeScript animation engine on the web. With its updated documentation and powerful features, Shifty continues to be a valuable tool for developers looking to create smooth and performant animations in their projects.</p>\n"}