{"layout":"article.njk","title":"The Tragic Death of Inheritance in Programming Languages","date":"2023-07-03T03:00:00.000Z","formattedDate":"2023-7-3","source_link":"https://avivcarmi.com/the-tragic-death-of-inheritance/","tags":["go","rust","java"],"topics":[{"name":"Go","slug":"go"},{"name":"Rust","slug":"rust"},{"name":"Java","slug":"java"}],"content":"<p>In recent years, programming languages like Rust and Go have been challenging the traditional concept of inheritance. Many engineers are joining the movement, but what is the reason behind this shift? Is inheritance really on its way out?</p>\n<p>Aviv Carmi, a seasoned developer, shares his personal journey in an article titled &quot;The Tragic Death of Inheritance.&quot; Initially, Carmi was a strong advocate for inheritance, having worked with languages like Java, JavaScript, Python, C#, and PHP. However, after five years of extensive coding in Go, he had a change of heart.</p>\n<p>Go, unlike other languages, does not support inheritance or abstract classes. At first, Carmi still argued for inheritance, but over time, he realized the power of composition. He now believes that composition is a superior choice in most cases.</p>\n<p>So, what led to this shift in perspective? Carmi breaks it down in his article, highlighting the benefits of composition over inheritance. He emphasizes that changing one&#39;s mind is never easy, but it is essential for growth and improvement.</p>\n<p>For developers keeping up with the latest industry trends, this article serves as a reminder that inheritance is not the only approach to object-oriented programming. By exploring alternatives like composition, developers can write more flexible and maintainable code.</p>\n<p>Here&#39;s an example of how composition can be used in Go:</p>\n<pre><code class=\"language-go\">type Car struct {\n    engine Engine\n    wheels []Wheel\n}\n\ntype Engine struct {\n    // engine properties\n}\n\ntype Wheel struct {\n    // wheel properties\n}\n\nfunc (c *Car) Start() {\n    c.engine.Start()\n}\n\nfunc (c *Car) Drive() {\n    // driving logic\n}\n</code></pre>\n<p>In this example, a <code>Car</code> struct is composed of an <code>Engine</code> and a slice of <code>Wheel</code> structs. The <code>Car</code> can start and drive by utilizing the methods of its composed components.</p>\n<p>As the industry evolves, it is crucial for developers to embrace new paradigms and challenge established conventions. The death of inheritance may not be imminent, but it is essential to explore alternatives like composition to create more robust and scalable software.</p>\n<p>Read Aviv Carmi&#39;s full article <a href=\"link-to-the-article\">here</a> to gain a deeper understanding of the shift away from inheritance and the rise of composition in modern programming languages.</p>\n"}