{"layout":"article.njk","title":"Improving Bracket Pair Colorization in VS Code","date":"2023-06-22T03:00:00.000Z","formattedDate":"2023-6-22","source_link":"https://code.visualstudio.com/blogs/2021/09/29/bracket-pair-colorization","tags":["vscode"],"topics":[{"name":"VSCode","slug":"vscode"}],"content":"<p>Visual Studio Code is a popular code editor that offers a wide range of extensions to enhance its functionality. One of the most downloaded extensions on the VS Code Marketplace is the Bracket Pair Colorizer, which helps developers identify matching bracket pairs by colorizing them. However, the extension has faced performance and accuracy issues, especially when dealing with deeply nested brackets.</p>\n<p>To address these issues, CoenraadS, the creator of the extension, released Bracket Pair Colorizer 2 in 2018, which has over 3 million installs. The extension makes heavy use of the Decoration API to colorize brackets and is a great example of the power of VS Code&#39;s extensibility.</p>\n<p>In addition to Bracket Pair Colorizer, there are many other community-provided extensions that offer creative ways to identify matching bracket pairs, such as Rainbow Brackets, Subtle Match Brackets, Bracket Highlighter, Blockman, and Bracket Lens. This variety of extensions shows that there is a real desire by VS Code users to get better support for brackets.</p>\n<p>The latest version of VS Code, version 1.79, includes improvements to Bracket Pair Colorization, making it 10,000x faster. This improvement is a result of the VS Code team&#39;s efforts to optimize the performance of the Decoration API. This enhancement will greatly benefit developers who work with deeply nested brackets and will improve their productivity.</p>\n<p>In conclusion, VS Code&#39;s extensibility and the community-provided extensions offer developers a wide range of tools to enhance their coding experience. The improvements to Bracket Pair Colorization in VS Code 1.79 will greatly benefit developers who work with deeply nested brackets and will make their work more efficient.</p>\n"}