{"layout":"article.njk","title":"Lemmy: A Link Aggregator and Forum for the Fediverse","date":"2023-06-22T03:00:00.000Z","formattedDate":"2023-6-22","source_link":"https://github.com/LemmyNet/lemmy","tags":["rust","github"],"topics":[{"name":"Rust","slug":"rust"},{"name":"GitHub","slug":"github"}],"content":"<p>Lemmy is an open-source link aggregator and forum for the fediverse, written in Rust. It allows users to create their own communities, share links and discussions, and vote and comment on posts. Lemmy is designed to be decentralized, meaning that no single entity controls the platform, and users can connect to different instances of the software.</p>\n<p>Lemmy&#39;s codebase is available on GitHub under the AGPL-3.0 license, and it has gained popularity in the Rust community, with over 10,000 stars and 653 forks. The project is actively maintained, with frequent updates and bug fixes.</p>\n<p>Developers interested in contributing to Lemmy can start by checking out the project&#39;s issues on GitHub. The project&#39;s codebase is written in Rust, a language known for its safety and performance. Rust&#39;s ownership and borrowing system make it easier to write efficient and secure code, which is important in a project like Lemmy that deals with user-generated content.</p>\n<p>Here&#39;s an example of how to use Lemmy&#39;s API to fetch posts from a community:</p>\n<pre><code class=\"language-rust\">use reqwest::Client;\n\nfn main() -&gt; Result&lt;(), Box&lt;dyn std::error::Error&gt;&gt; {\n    let client = Client::new();\n    let response = client.get(&quot;https://lemmy.ml/api/v3/c/programming/posts&quot;).send()?;\n    let posts: Vec&lt;lemmy_api::Post&gt; = response.json()?;\n    println!(&quot;{:#?}&quot;, posts);\n    Ok(())\n}\n</code></pre>\n<p>Lemmy is a promising project that offers a decentralized alternative to centralized social media platforms. Its use of Rust makes it a secure and reliable option for developers looking to build decentralized applications.</p>\n"}