{"layout":"article.njk","title":"New Release: React Native 0.64.0","date":"2023-06-22T03:00:00.000Z","formattedDate":"2023-6-22","source_link":"https://www.reuters.com/world/americas/ancient-maya-city-discovered-mexican-jungle-2023-06-21/","tags":["haskell","vim"],"topics":[{"name":"Haskell","slug":"haskell"},{"name":"Vim","slug":"vim"}],"content":"<p>React Native, a popular framework for building mobile applications, has released version 0.64.0. This version includes several new features and improvements, making it easier for developers to build high-quality mobile apps.</p>\n<p>One of the key features of this release is the new Hermes engine, which is now the default JavaScript engine for Android. Hermes is a lightweight JavaScript engine that can improve the startup time and reduce the memory footprint of React Native apps. This can result in faster and more responsive apps for users.</p>\n<p>Another notable feature is the new LogBox component, which provides a better debugging experience for developers. LogBox replaces the previous YellowBox component and offers a more streamlined and customizable interface for displaying and managing logs.</p>\n<p>In addition to these new features, version 0.64.0 includes several bug fixes and performance improvements. The React Native team has also made significant progress in migrating the framework to use the latest version of Apple&#39;s Xcode build system, which is expected to improve the stability and performance of iOS apps built with React Native.</p>\n<p>Developers can upgrade to version 0.64.0 by following the upgrade instructions provided in the official React Native documentation. As always, it is recommended to thoroughly test your app after upgrading to ensure compatibility with the new version.</p>\n<p>Overall, React Native 0.64.0 is a significant release that brings several new features and improvements to the framework. With the new Hermes engine and LogBox component, developers can build faster and more reliable mobile apps with React Native.</p>\n"}