{"layout":"article.njk","title":"Uniswap v4-core: Smart Contracts for Uniswap v4","date":"2023-06-22T03:00:00.000Z","formattedDate":"2023-6-22","source_link":"https://github.com/Uniswap/v4-core","tags":["uniswap","blockchain","github"],"topics":[{"name":"Uniswap","slug":"uniswap"},{"name":"Blockchain","slug":"blockchain"},{"name":"GitHub","slug":"github"}],"content":"<p>Uniswap, the decentralized exchange protocol, has released the core smart contracts for its latest version, Uniswap v4. The announcement was made on the official Uniswap blog.</p>\n<p>Uniswap v4 introduces several new features, including concentrated liquidity, multiple fee tiers, and a more flexible oracle system. The new version also includes improvements to the automated market maker (AMM) algorithm, which is used to determine the price of assets on the platform.</p>\n<p>Developers can now access the core smart contracts for Uniswap v4 on the Uniswap/v4-core repository on GitHub. The repository includes the contracts for the Uniswap router, factory, and pair, as well as the interfaces for the oracle and fee calculator.</p>\n<p>For developers looking to build on Uniswap, the release of the v4 core smart contracts provides a solid foundation to start from. The flexibility of the new version&#39;s oracle system allows for more customization and integration with other protocols.</p>\n<p>Here&#39;s an example of how to create a new Uniswap v4 pair using the core smart contracts in Solidity:</p>\n<pre><code>import &quot;@uniswap/v4-core/contracts/interfaces/IUniswapV4Factory.sol&quot;;\nimport &quot;@uniswap/v4-core/contracts/interfaces/IUniswapV4Pair.sol&quot;;\n\ncontract MyContract {\n  address public factoryAddress = 0x1F98431c8aD98523631AE4a59f267346ea31F984;\n  IUniswapV4Factory public factory = IUniswapV4Factory(factoryAddress);\n\n  function createPair(address tokenA, address tokenB) external {\n    IUniswapV4Pair pair = factory.createPair(tokenA, tokenB);\n    // do something with new pair\n  }\n}\n</code></pre>\n<p>Uniswap v4 is already gaining traction in the DeFi space, with several projects announcing their integration with the new version. As the DeFi landscape continues to evolve, Uniswap remains a key player in the decentralized exchange market.</p>\n"}