{"layout":"article.njk","title":"Rust 1.70.0 released","date":"2023-06-01T03:00:00.000Z","formattedDate":"2023-6-1","source_link":"https://blog.rust-lang.org/2023/06/01/Rust-1.70.0.html","tags":["rust"],"topics":[{"name":"Rust","slug":"rust"}],"content":"<p>The Rust team has announced the release of Rust 1.70.0, a programming language that empowers developers to build reliable and efficient software. This version comes with several new features and improvements that make it an exciting release for Rust developers.</p>\n<p>Sparse by default for crates.io\nOne of the most significant changes in Rust 1.70.0 is the default enabling of Cargo&#39;s &quot;sparse&quot; protocol for reading the index from crates.io. This feature was previously stabilized with Rust 1.68.0 but still required configuration to use with crates.io. The plan was to make it the default in 1.70.0, which has now been implemented.</p>\n<p>This change means that developers should see substantial improvements in performance when fetching information from the crates.io index. However, users behind a restrictive firewall will need to ensure that access to <a href=\"https://index.crates.io\">https://index.crates.io</a> is available. If you need to stay with the previous default of using the git index hosted by GitHub, the registries.crates-io.protocol config setting can be used to change the default.</p>\n<p>Updating to Rust 1.70.0\nIf you have a previous version of Rust installed via rustup, you can update to Rust 1.70.0 with the following command:</p>\n<pre><code>rustup update stable\n</code></pre>\n<p>If you don&#39;t have rustup already, you can get it from the Rust website. Once you have rustup installed, you can update to Rust 1.70.0 with the above command.</p>\n<p>Testing future releases\nDevelopers who want to help test future releases of Rust can update locally to use the beta channel or the nightly channel. To update to the beta channel, use the following command:</p>\n<pre><code>rustup default beta\n</code></pre>\n<p>To update to the nightly channel, use the following command:</p>\n<pre><code>rustup default nightly\n</code></pre>\n<p>If you come across any bugs while testing future releases, please report them to the Rust team.</p>\n<p>Conclusion\nRust 1.70.0 is an exciting release for Rust developers, with the default enabling of Cargo&#39;s &quot;sparse&quot; protocol for reading the index from crates.io being one of the most significant changes. Developers should see substantial improvements in performance when fetching information from the crates.io index. If you&#39;re a Rust developer, make sure to update to Rust 1.70.0 and test future releases to help improve the language.</p>\n"}