{"layout":"article.njk","title":"Jellyfin: A Free Software Media System","date":"2023-06-18T03:00:00.000Z","formattedDate":"2023-6-18","source_link":"https://github.com/jellyfin/jellyfin","tags":["programming-languages","media-systems"],"topics":[{"name":"Programming Languages","slug":"programming-languages"},{"name":"Media Systems","slug":"media-systems"}],"content":"<p>Jellyfin is a free software media system that allows users to manage and stream their media from a dedicated server to multiple devices through various apps. It is a great alternative to proprietary media systems such as Emby and Plex. Jellyfin is built on the .NET Core framework, enabling full cross-platform support, and is descended from Emby&#39;s 3.5.2 release. </p>\n<p>Unlike other media systems, Jellyfin does not have any premium licenses or hidden agendas. It is completely free and open-source, with a team dedicated to building something better. Jellyfin allows users to customize their media experience, with features such as parental controls, live TV, and more. </p>\n<p>Jellyfin&#39;s documentation page provides further details on how to set up and use the system. The community is also very active, providing help and support to users. Jellyfin is constantly updated with new features and improvements, making it a great choice for developers who want to keep up with the latest news in the industry. </p>\n<p>Here&#39;s a code snippet to show how easy it is to install Jellyfin on Linux:</p>\n<pre><code>sudo apt-get update\nsudo apt-get install apt-transport-https\nwget -O - https://repo.jellyfin.org/ubuntu/jellyfin_team.gpg.key | sudo apt-key add -\necho &quot;deb [arch=$( dpkg --print-architecture )] https://repo.jellyfin.org/ubuntu $( lsb_release -c -s ) main&quot; | sudo tee /etc/apt/sources.list.d/jellyfin.list\nsudo apt-get update\nsudo apt-get install jellyfin\n</code></pre>\n<p>Jellyfin is a great choice for developers who want a free and customizable media system. With its active community and constant updates, it is definitely worth checking out.</p>\n"}