{"layout":"article.njk","title":"Building Server-Side Rendered Svelte Apps with SvelteKit","date":"2023-06-14T03:00:00.000Z","formattedDate":"2023-6-14","source_link":"https://smashingmagazine.com/2023/06/build-server-side-rendered-svelte-apps-sveltekit/","tags":["svelte"],"topics":[{"name":"Svelte","slug":"svelte"}],"content":"<p>SvelteKit is a framework for building web applications with Svelte that offers server-side rendering (SSR) out of the box. This means that the server generates HTML for the initial page load, which can improve performance and SEO. In this article, we will explore how to build SSR Svelte apps with SvelteKit.</p>\n<p>Traditionally, building an SSR app with Svelte required maintaining two codebases: one for the server and one for the client. The server code would run in Node.js and use a templating engine like Handlebars or Mustache to generate HTML. The client code would be a Svelte app that fetches data from the server. This approach can be complex and error-prone.</p>\n<p>SvelteKit simplifies this process by handling the complexity of the server and client on its own. It supports both SSR and client-side rendering (CSR) and allows you to write your app as a single codebase. SvelteKit uses the same syntax as Svelte, so if you&#39;re familiar with Svelte, you&#39;ll feel right at home.</p>\n<p>To get started with SvelteKit, you can use the <code>create-svelte</code> command to create a new project. SvelteKit includes a dev server that supports hot module reloading, so you can see your changes in real-time. SvelteKit also includes built-in support for routing, API endpoints, and static site generation.</p>\n<p>One of the benefits of using SvelteKit is that it generates optimized code for both the server and client. This means that your app will load faster and use less bandwidth. SvelteKit also includes features like prefetching and preloading, which can further improve performance.</p>\n<p>In conclusion, SvelteKit is a powerful framework for building SSR Svelte apps. It simplifies the process of building an SSR app and generates optimized code for both the server and client. If you&#39;re looking to build a fast and scalable web app with Svelte, SvelteKit is definitely worth checking out.</p>\n"}