{"layout":"article.njk","title":"Boilerplate Flask + GCP Cloud Run + Docker + Gitlab: A Comprehensive Guide","date":"2023-06-06T03:00:00.000Z","formattedDate":"2023-6-6","source_link":"https://gitlab.com/dag83/boilerplate-flask-gcp-cloud-run-docker-gitlab","tags":["python","flask","gcp","docker"],"topics":[{"name":"Python","slug":"python"},{"name":"Flask","slug":"flask"},{"name":"GCP","slug":"gcp"},{"name":"Docker","slug":"docker"}],"content":"<p>This article was originally published on GitLab and we have brought it to you as a comprehensive guide to help you get started with building your own Flask application on GCP Cloud Run with Docker and Gitlab.</p>\n<p>Flask is a popular Python web framework that is known for its simplicity and flexibility. It is widely used for building web applications and APIs. GCP Cloud Run is a fully managed serverless platform that allows you to run your containerized applications with ease. Docker is a containerization platform that allows you to package your application with all its dependencies into a single container. Gitlab is a web-based Git repository manager that provides continuous integration and continuous deployment (CI/CD) capabilities.</p>\n<p>In this guide, we will walk you through the process of setting up a Flask application on GCP Cloud Run with Docker and Gitlab. We will cover the following topics:</p>\n<ol>\n<li>Setting up a Flask application</li>\n<li>Creating a Dockerfile for your Flask application</li>\n<li>Deploying your Flask application to GCP Cloud Run</li>\n<li>Setting up CI/CD with Gitlab</li>\n</ol>\n<p>Setting up a Flask application</p>\n<p>First, you need to create a Flask application. You can create a new Flask application by running the following command:</p>\n<pre><code>$ pip install flask\n$ mkdir myapp\n$ cd myapp\n$ touch app.py\n</code></pre>\n<p>Next, open the app.py file and add the following code:</p>\n<pre><code class=\"language-python\">from flask import Flask\n\napp = Flask(__name__)\n\n@app.route(&#39;/&#39;)\ndef hello_world():\n    return &#39;Hello, World!&#39;\n</code></pre>\n<p>This code creates a simple Flask application that returns &quot;Hello, World!&quot; when you visit the root URL.</p>\n<p>Creating a Dockerfile for your Flask application</p>\n<p>Next, you need to create a Dockerfile for your Flask application. The Dockerfile is a text file that contains instructions for building a Docker image. Here&#39;s an example Dockerfile for a Flask application:</p>\n<pre><code class=\"language-Dockerfile\"># Use an official Python runtime as a parent image\nFROM python:3.8-slim-buster\n\n# Set the working directory to /app\nWORKDIR /app\n\n# Copy the current directory contents into the container at /app\nCOPY . /app\n\n# Install the required packages\nRUN pip install --no-cache-dir -r requirements.txt\n\n# Make port 8080 available to the world outside this container\nEXPOSE 8080\n\n# Define environment variable\nENV NAME World\n\n# Run app.py when the container launches\nCMD [&quot;python&quot;, &quot;app.py&quot;]\n</code></pre>\n<p>This Dockerfile starts with an official Python 3.8 image, sets the working directory to /app, copies the contents of the current directory into the container, installs the required packages, exposes port 8080, sets an environment variable, and runs the app.py file when the container launches.</p>\n<p>Deploying your Flask application to GCP Cloud Run</p>\n<p>Now that you have created a Dockerfile for your Flask application, you can deploy it to GCP Cloud Run. Here are the steps:</p>\n<ol>\n<li>Install the Google Cloud SDK</li>\n<li>Build the Docker image</li>\n<li>Push the Docker image to Google Container Registry</li>\n<li>Deploy the Docker image to GCP Cloud Run</li>\n</ol>\n<p>Here&#39;s an example command to build the Docker image:</p>\n<pre><code>$ docker build -t myapp .\n</code></pre>\n<p>This command builds a Docker image with the tag &quot;myapp&quot;.</p>\n<p>Next, you need to push the Docker image to Google Container Registry. Here&#39;s an example command:</p>\n<pre><code>$ docker tag myapp gcr.io/myproject/myapp\n$ docker push gcr.io/myproject/myapp\n</code></pre>\n<p>This command tags the Docker image with the registry name and pushes it to Google Container Registry.</p>\n<p>Finally, you can deploy the Docker image to GCP Cloud Run. Here&#39;s an example command:</p>\n<pre><code>$ gcloud run deploy --image gcr.io/myproject/myapp --platform managed\n</code></pre>\n<p>This command deploys the Docker image to GCP Cloud Run on the managed platform.</p>\n<p>Setting up CI/CD with Gitlab</p>\n<p>Now that you have deployed your Flask application to GCP Cloud Run, you can set up CI/CD with Gitlab. Here are the steps:</p>\n<ol>\n<li>Create a Gitlab repository for your Flask application</li>\n<li>Create a .gitlab-ci.yml file in the root directory of your repository</li>\n<li>Define the stages and jobs for your CI/CD pipeline</li>\n<li>Add the CI/CD variables to your Gitlab project</li>\n</ol>\n<p>Here&#39;s an example .gitlab-ci.yml file:</p>\n<pre><code class=\"language-yaml\">image: docker:latest\n\nservices:\n  - docker:dind\n\nstages:\n  - build\n  - test\n  - deploy\n\nbuild:\n  stage: build\n  script:\n    - docker build -t myapp .\n    - docker tag myapp gcr.io/myproject/myapp\n    - echo &quot;$GOOGLE_SERVICE_ACCOUNT&quot; &gt; /tmp/key.json\n    - gcloud auth activate-service-account --key-file /tmp/key.json\n    - gcloud config set project myproject\n    - gcloud auth configure-docker\n    - docker push gcr.io/myproject/myapp\n\ntest:\n  stage: test\n  script:\n    - echo &quot;Running tests&quot;\n\ndeploy:\n  stage: deploy\n  script:\n    - gcloud run deploy --image gcr.io/myproject/myapp --platform managed\n</code></pre>\n<p>This .gitlab-ci.yml file defines three stages: build, test, and deploy. The build stage builds the Docker image, tags it, and pushes it to Google Container Registry. The test stage runs any tests that you have defined. The deploy stage deploys the Docker image to GCP Cloud Run.</p>\n<p>Finally, you need to add the CI/CD variables to your Gitlab project. Here are the variables that you need to add:</p>\n<ul>\n<li>GOOGLE_SERVICE_ACCOUNT: The JSON key for your GCP service account</li>\n<li>GOOGLE_PROJECT_ID: The ID of your GCP project</li>\n</ul>\n<p>Conclusion</p>\n<p>In this guide, we have shown you how to set up a Flask application on GCP Cloud Run with Docker and Gitlab. We have covered the basics of Flask, Docker, and GCP Cloud Run, and we have shown you how to deploy your application to GCP Cloud Run and set up CI/CD with Gitlab. We hope that this guide has been helpful to you and that you are now ready to build your own Flask application on GCP Cloud Run with Docker and Gitlab.</p>\n"}