{"layout":"article.njk","title":"Improving Page Performance with Nuxt 3's Render-Blocking CSS Solution","date":"2023-06-08T03:00:00.000Z","formattedDate":"2023-6-8","source_link":"https://deltener.com/blog/stop-render-blocking-css-in-nuxt/","tags":["nuxt"],"topics":[{"name":"Nuxt","slug":"nuxt"}],"content":"<p>When it comes to page performance and web vitals, small tweaks can make a big difference. One example is Largest Contentful Paint (LCP) and its relationship with Cascading Style Sheets (CSS). When you visit a site, the server should send back a full page of HTML for your browser to start rendering. However, if that HTML contains references to CSS files, the browser can&#39;t start rendering the page until that CSS is fully downloaded and parsed. This can cause delays in page load times and affect the user experience.</p>\n<p>Nuxt 3, the latest version of the popular Vue.js framework, offers a solution to this problem with its Render-Blocking CSS feature. By default, Nuxt 3 injects global CSS into a file called entry.css (with a hash), and links to it from the server response. However, this can cause delays in page rendering as the browser must download the CSS file before it can start rendering the page.</p>\n<p>To address this issue, Nuxt 3&#39;s Render-Blocking CSS solution allows developers to split their CSS into critical and non-critical parts. Critical CSS is inlined into the HTML, while non-critical CSS is loaded asynchronously. This allows the browser to start rendering the page with the critical CSS, while the non-critical CSS is downloaded and parsed in the background.</p>\n<p>To use Render-Blocking CSS in Nuxt 3, developers can use the <client-only> component to load non-critical CSS asynchronously. Here&#39;s an example:</p>\n<template>\n  <div>\n    <h1>Hello World!</h1>\n    <client-only>\n      <link rel=\"stylesheet\" href=\"/non-critical.css\">\n    </client-only>\n  </div>\n</template>\n\n<p>In this example, the non-critical CSS is loaded asynchronously using the <client-only> component. This allows the browser to start rendering the page with the critical CSS, while the non-critical CSS is downloaded and parsed in the background.</p>\n<p>By using Nuxt 3&#39;s Render-Blocking CSS solution, developers can improve page performance and user experience by reducing page load times. This is especially important for websites with large CSS files, such as those that use UI frameworks like Tailwind.</p>\n<p>In addition to Render-Blocking CSS, Nuxt 3 offers a range of other performance optimizations, including automatic image optimization, code splitting, and lazy loading. These features make it easier for developers to create fast and responsive websites that meet the latest web performance standards.</p>\n<p>In conclusion, Nuxt 3&#39;s Render-Blocking CSS solution is a powerful tool for improving page performance and user experience. By splitting CSS into critical and non-critical parts, developers can reduce page load times and ensure that their websites meet the latest web performance standards.</p>\n"}