{"layout":"article.njk","title":"Node.js v20.3.0 (Current) Released","date":"2023-06-08T03:00:00.000Z","formattedDate":"2023-6-8","source_link":"https://nodejs.org/en/blog/release/v20.3.0","tags":["nodejs"],"topics":[{"name":"Node.js","slug":"nodejs"}],"content":"<p>Node.js, a popular JavaScript runtime, has just released its latest version, v20.3.0. This version includes several notable changes and improvements that developers should be aware of.</p>\n<p>One of the most significant changes in this release is the upgrade to libuv 1.45.0, which brings significant performance improvements to file system operations on Linux. This improvement was contributed by Santiago Gimeno and can be found in issue #48078.</p>\n<p>Another notable change is the addition of Ruy Adorno to the list of Technical Steering Committee (TSC) members, as documented in issue #48172 by Michael Dawson. This change reflects the continued growth and evolution of the Node.js community.</p>\n<p>Node.js 14 has also been marked as End-of-Life, as documented in issue #48023 by Richard Lau. Developers should take note of this and plan accordingly.</p>\n<p>One new feature that developers may find useful is the implementation of AbortSignal.any(), which is a new method in the AbortSignal class. This feature was contributed by Chemi Atlow and can be found in issue #47821.</p>\n<p>Another change that may impact developers is the modification of the default resolver in the module system. Previously, the resolver would throw an error if it encountered an unknown scheme. Now, it will simply return null. This change was contributed by Gil Tayar and can be found in issue #47824.</p>\n<p>In addition to these changes, there are several other commits and improvements in this release that developers may find useful. For example, the stream module has deprecated the asIndexedPairs method, as documented in issue #48102 by Chemi Atlow.</p>\n<p>Developers who are interested in benchmarking may also find the change documented in issue #48002 by Deokjin Kim useful. This change updates the cluster.isMaster method to cluster.isPrimary, which can improve performance in some cases.</p>\n<p>Finally, developers who are interested in contributing to Node.js may find the addition of an action to close stale pull requests useful, as documented in issue #48051 by Michael Dawson.</p>\n<p>Overall, Node.js v20.3.0 (Current) includes several notable changes and improvements that developers should be aware of. As always, developers are encouraged to stay up-to-date with the latest releases and changes in order to take advantage of new features and improvements.</p>\n"}