{"layout":"article.njk","title":"PostgreSQL Considers Moving to a Threaded Model","date":"2023-06-19T03:00:00.000Z","formattedDate":"2023-6-19","source_link":"https://lwn.net/SubscriberLink/934940/3abb2d4086680b78/","tags":["programming-languages","databases"],"topics":[{"name":"Programming Languages","slug":"programming-languages"},{"name":"Databases","slug":"databases"}],"content":"<p>PostgreSQL, a popular open-source relational database management system, is considering a move from its current process-based model to a threaded model. Currently, a PostgreSQL instance runs as a set of cooperating processes, including one for each connected client. These processes communicate through shared-memory regions using a library that enables the creation of complex data structures. While this model has served the project well for many years, PostgreSQL developers are increasingly thinking that it may be time to make a change.</p>\n<p>At the beginning of June, Heikki Linnakangas proposed the move to a threaded model. The message acknowledged the challenges involved in making such a move and stated that this transition &quot;surely cannot be done fully in one release.&quot; The proposal has sparked discussions among PostgreSQL developers about the potential benefits and drawbacks of a threaded model.</p>\n<p>Moving to a threaded model could improve PostgreSQL&#39;s performance and scalability, especially in multi-core systems. However, it could also introduce new challenges, such as increased complexity and potential issues with locking and synchronization.</p>\n<p>Developers interested in keeping up with the latest news on PostgreSQL should follow the discussions on the PostgreSQL mailing lists and forums. As always, it&#39;s important to weigh the potential benefits and drawbacks of any changes to a system before implementing them. </p>\n<pre><code class=\"language-python\"># Example code snippet\nimport psycopg2\n\nconn = psycopg2.connect(database=&quot;mydatabase&quot;, user=&quot;myusername&quot;, password=&quot;mypassword&quot;, host=&quot;localhost&quot;, port=&quot;5432&quot;)\ncur = conn.cursor()\ncur.execute(&quot;SELECT * FROM mytable&quot;)\nrows = cur.fetchall()\nfor row in rows:\n    print(row)\nconn.close()\n</code></pre>\n"}