{"layout":"article.njk","title":"JMAP: The Modern Email Standard for Developers","date":"2023-05-30T03:00:00.000Z","formattedDate":"2023-5-30","source_link":"https://jmap.io/","tags":["email"],"topics":[{"name":"Email","slug":"email"}],"content":"<p>JMAP, the open API standard for modern mail clients and applications, has been published by the Internet Engineering Task Force (IETF). Developed by Fastmail, JMAP is a new protocol that aims to make email more open and accessible to innovators. Unlike proprietary email APIs that only work with specific email clients, JMAP is a much-needed modern email standard that meets today&#39;s expectations of developers and users for connectivity, efficiency, and mobile access.</p>\n<p>JMAP is not a conversion of IMAP to JSON; it is a new protocol that makes much more efficient use of network resources and is easier for developers to work with. It is based on years of experience and real-world experimentation at Fastmail, and on talking to other major MUA/MTA developers to understand the common needs of the industry.</p>\n<p>JMAP&#39;s key attributes include:</p>\n<ul>\n<li>Efficient network usage: JMAP minimizes the amount of data transferred between the client and server, resulting in faster email access and reduced data usage.</li>\n<li>Easy to use: JMAP is designed to be easy for developers to work with, with a simple and consistent API.</li>\n<li>Mobile-friendly: JMAP is optimized for mobile devices, with support for push notifications and real-time updates.</li>\n<li>Open and interoperable: JMAP is an open standard that anyone can implement, making it easier for developers to create innovative email applications and services.</li>\n</ul>\n<p>Developers can start developing on JMAP standards by accessing the free resources provided by Fastmail. JMAP is widely supported in all operating systems and programming languages, making it easy for developers to adopt. With JMAP, developers can create modern email applications that are more efficient, mobile-friendly, and interoperable.</p>\n"}