{"layout":"article.njk","title":"Kotlin 1.9.0 Released","date":"2023-07-06T03:00:00.000Z","formattedDate":"2023-7-6","source_link":"https://blog.jetbrains.com/kotlin/2023/07/kotlin-1-9-0-released/","tags":["kotlin"],"topics":[{"name":"Kotlin","slug":"kotlin"}],"content":"<p>The latest release of Kotlin, version 1.9.0, is now available. This release brings new language features and improvements for Kotlin Multiplatform and Kotlin/Native. One of the highlights of this release is the Beta version of the new K2 compiler for the JVM.</p>\n<p>The Kotlin team at JetBrains has been working hard to stabilize the K2 compiler, and it has now achieved its Beta milestone on the way to the Kotlin 2.0 release. The K2 compiler aims to improve performance, speed up language feature development, unify all platforms that Kotlin supports, and provide a better architecture for multiplatform projects.</p>\n<p>To facilitate compatibility with other compiler plugins, the Kotlin team plans to integrate support for Kotlin Symbol Processing (KSP) and Jetpack Compose in the future. They encourage developers to test out the K2 compiler on their Kotlin/JVM projects and provide feedback to help refine it before it becomes the default stable compiler in Kotlin 2.0.</p>\n<p>In addition to the K2 compiler, the Kotlin team is also focused on stabilizing Kotlin Multiplatform support. Their goal is to achieve full beta-quality support for multiplatform projects in K2 alongside the stable release of Kotlin Multiplatform.</p>\n<p>To install Kotlin 1.9.0, IntelliJ IDEA 2022.3.3, 2023.1.1, or Android Studio Giraffe (223) and Hedgehog (231) will suggest updating automatically. Alternatively, you can update manually by following the provided instructions. Android Studio 2023.2 will come with the built-in Kotlin 1.9.0 plugin. The command-line compiler can be downloaded from the GitHub release page.</p>\n<p>Developers are encouraged to stay up to date with the latest Kotlin features by subscribing to receive Kotlin updates. The Kotlin team values feedback from the community and invites developers to share their thoughts and experiences with the K2 compiler and Kotlin Multiplatform stabilization.</p>\n<p>Overall, Kotlin 1.9.0 brings exciting new features and improvements that developers can leverage to enhance their Kotlin projects.</p>\n"}