{"layout":"article.njk","title":"Redwood: A Multiplatform UI Framework for Native Apps","date":"2023-07-06T03:00:00.000Z","formattedDate":"2023-7-6","source_link":"https://code.cash.app/native-ui-and-multiplatform-compose-with-redwood","tags":["kotlin","redwood","ui","compose"],"topics":[{"name":"Kotlin","slug":"kotlin"},{"name":"Redwood","slug":"redwood"},{"name":"UI","slug":"ui"},{"name":"Compose","slug":"compose"}],"content":"<p>Redwood is Cash App&#39;s solution for multiplatform mobile client UI development. Built on top of the Kotlin programming language, Redwood enables developers to create native UIs for Android, iOS, and the web using a single codebase. By leveraging the power of Compose, a UI toolkit developed by JetBrains, Redwood simplifies the process of creating UI nodes and managing state across different platforms.</p>\n<p>One of the key features of Redwood is its ability to generate a common definition of UI widgets, known as the schema. This schema serves as a programmatic representation of the app&#39;s design system, allowing developers to easily interface with each platform&#39;s native UI toolkit. Redwood takes care of the plumbing by binding the generated composables to the native UI components.</p>\n<p>In addition to its multiplatform capabilities, Redwood also introduces Treehouse, a module that utilizes Zipline to dynamically update the composable logic at runtime. This not only improves the development experience but also enables app logic updates without requiring app upgrades.</p>\n<p>Today, Cash App is releasing Redwood 0.5, marking it as a &quot;beta&quot; version. While breaking changes are still allowed, all changes will be compatible with previous versions when running across the updatable Treehouse bridge. This means that future versions of Redwood can still target older apps running Redwood 0.5.</p>\n<p>If you&#39;re interested in learning more about Redwood, Zipline, and Treehouse, Cash App recommends watching their recent conference talks. With the beta release of Redwood, Cash App is excited to start rolling out experiences to all customers soon.</p>\n<p>This article is part of Cash App&#39;s Summer of Kotlin Multiplatform series, showcasing the power and versatility of Kotlin for multiplatform development.</p>\n"}