{"layout":"article.njk","title":"Visual Studio Code June 2023","date":"2023-07-06T03:00:00.000Z","formattedDate":"2023-7-6","source_link":"https://code.visualstudio.com/updates/v1_80","tags":["typescript","visual-studio-code"],"topics":[{"name":"TypeScript","slug":"typescript"},{"name":"Visual Studio Code","slug":"visual-studio-code"}],"content":"<p>Version 1.80 is now available! Read about the new features and fixes from June.</p>\n<p>The June 2023 release of Visual Studio Code brings several updates that developers will find useful. Some of the key highlights include:</p>\n<ol>\n<li><p>Accessibility improvements:</p>\n<ul>\n<li>A new command, &quot;Open Accessible View,&quot; allows screen reader users to inspect content character by character, line by line.</li>\n<li>An &quot;Open Accessibility Help&quot; command opens a help menu based on the current context, providing assistance for the editor, terminal, notebook, chat panel, and inline chat features.</li>\n<li>Accessibility help menus were added for notebooks, providing information about the editor layout and navigation.</li>\n</ul>\n</li>\n<li><p>Chat enhancements:</p>\n<ul>\n<li>Audio cues have been added for the GitHub Copilot chat experience.</li>\n<li>Chat responses are now provided to screen readers as soon as they come in.</li>\n<li>The inline and chat panel accessibility help menus contain more detailed information about interacting with each feature.</li>\n</ul>\n</li>\n<li><p>Settings editor improvements:</p>\n<ul>\n<li>The Settings editor is now less verbose when navigating with a screen reader.</li>\n<li>The settings description alt text has been cleaned up to remove raw Markdown formatting.</li>\n</ul>\n</li>\n<li><p>Workbench enhancements:</p>\n<ul>\n<li>Autoplaying and looping for previewed videos can now be enabled.</li>\n<li>More help is provided when attempting to type in a readonly editor.</li>\n<li>The default location for file dialogs can be configured.</li>\n</ul>\n</li>\n</ol>\n<p>For more details and to download the latest version, visit the Visual Studio Code website. Developers can also try new features by downloading the nightly Insiders build.</p>\n"}