{"layout":"article.njk","title":"6 Common Misconceptions Around Akka-HTTP","date":"2023-07-05T03:00:00.000Z","formattedDate":"2023-7-5","source_link":"https://www.iteratorshq.com/blog/6-common-misconceptions-around-akka-http-pekko-http/","tags":["scala","akka-http","pekko-http"],"topics":[{"name":"Scala","slug":"scala"},{"name":"Akka-HTTP","slug":"akka-http"},{"name":"Pekko-HTTP","slug":"pekko-http"}],"content":"<p>Akka-HTTP, powered by Akka, is a widely used foundation for many Scala and Java web services. Despite recent controversy surrounding its license changes, there are no signs of it fading away. The Apache Software Foundation has even submitted Pekko, an alternative to Akka-HTTP, to the Apache Incubator, ensuring the continued maintenance and development of the Akka ecosystem.</p>\n<p>One common misconception is that the routing in akka-http is unreadable. While some code examples may seem overwhelming, the DSL offers flexibility and can be written in a concise and readable manner. By using operators like ~, |, and &amp;, developers can significantly reduce nesting. Additionally, keeping the business logic separate from the routing helps to maintain clarity and simplicity.</p>\n<p>Compared to other frameworks like Play, which require defining routes in multiple places, akka-http&#39;s approach keeps the routing code in a single location. This allows developers to easily gather information about endpoints and their HTTP methods without switching between files.</p>\n<p>Overall, Akka-HTTP and its alternative Pekko offer powerful tools for building web services in Scala and Java. Developers can leverage the flexibility of the routing DSL and the declarative nature of directives to create efficient and maintainable code.</p>\n<pre><code class=\"language-scala\">// Example of concise routing in Akka-HTTP\ntrait MyRouter extends Directives {\n  val routes: Route = \n    path(&quot;hello&quot;) {\n      get {\n        complete(&quot;Hello, World!&quot;)\n      }\n    } ~\n    path(&quot;users&quot;) {\n      post {\n        entity(as[User]) { user =&gt;\n          complete(s&quot;Created user: $user&quot;)\n        }\n      }\n    }\n}\n</code></pre>\n<p>Check out our Scala 3 example of a pekko-http microservice to see how you can leverage these tools in your own projects!</p>\n"}