{"layout":"article.njk","title":"TypeSchema - Unified Interface for TypeScript Schema Validations","date":"2023-07-05T03:00:00.000Z","formattedDate":"2023-7-5","source_link":"https://typeschema.com","tags":["typescript","typeschema","zod","yup"],"topics":[{"name":"TypeScript","slug":"typescript"},{"name":"TypeSchema","slug":"typeschema"},{"name":"zod","slug":"zod"},{"name":"yup","slug":"yup"}],"content":"<p>TypeSchema is a powerful tool that provides a unified interface for schema validations in TypeScript. It offers a seamless way to validate data against predefined schemas, making it easier for developers to ensure data integrity and consistency in their applications.</p>\n<p>To get started with TypeSchema, simply install it using your preferred package manager:</p>\n<pre><code class=\"language-shell\">npm install typeschema\n</code></pre>\n<p>Once installed, you can use TypeSchema to define and validate your schemas. Here&#39;s an example:</p>\n<pre><code class=\"language-typescript\">import { TypeSchema, StringType } from &#39;typeschema&#39;;\n\nconst userSchema = TypeSchema.object({\n  name: StringType.required(),\n  age: StringType.number().min(18),\n  email: StringType.email(),\n});\n\nconst userData = {\n  name: &#39;John Doe&#39;,\n  age: 25,\n  email: &#39;john.doe@example.com&#39;,\n};\n\nconst isValid = userSchema.validate(userData);\n\nif (isValid) {\n  console.log(&#39;User data is valid&#39;);\n} else {\n  console.log(&#39;User data is invalid&#39;);\n}\n</code></pre>\n<p>TypeSchema also supports custom validations, allowing you to define your own validation rules. This flexibility makes it a versatile tool for handling complex data validation scenarios.</p>\n<p>TypeSchema is inspired by tRPC&#39;s input and output validators, and it aims to provide a seamless experience for TypeScript developers. It is actively maintained and has a growing community of contributors.</p>\n<p>For more information and detailed usage examples, you can refer to the <a href=\"https://github.com/ecs/typeschema\">TypeSchema GitHub repository</a>.</p>\n<p>TypeSchema is licensed under the MIT License and has gained popularity among developers, with a significant number of stars, watchers, and forks on GitHub.</p>\n<p>Stay tuned for the latest updates and news in the programming language and framework landscape by following our magazine, &quot;Dev Radar&quot;.</p>\n"}