{"layout":"article.njk","title":"Build Your Own Router in Ruby","date":"2023-07-04T03:00:00.000Z","formattedDate":"2023-7-4","source_link":"https://www.akshaykhot.com/build-your-own-router-in-ruby/","tags":["ruby"],"topics":[{"name":"Ruby","slug":"ruby"}],"content":"<p>In this article, the author explores the concept of a router in web applications and demonstrates how to build a router from scratch using Ruby. The author emphasizes the importance of understanding routing in order to gain a deeper appreciation for frameworks like Rails. The router built in this article is designed to resemble Rails&#39; router and offers a simple and expressive way to define routes and behavior. The article also mentions that future articles in the series will cover topics such as implementing controllers and models, processing forms and query data, connecting to databases, and writing authentication in plain Ruby. </p>\n<p>To begin, the author explains that a router is responsible for determining where incoming requests should go within a web application. It achieves this by examining the request URL and invoking a pre-defined function or handler for that path. The router stores the mapping between URL patterns and their corresponding handlers. </p>\n<p>The article then provides a link to a more in-depth resource on the Rails Router for readers who want to learn more about the topic. It also suggests reading a previous article in the series for better context. </p>\n<p>The article assumes no prior knowledge of routing and provides a brief overview of the current setup, which is a simple web application that returns the response &quot;Hello World!&quot; for every request. The author acknowledges that this behavior is not very useful and proceeds to demonstrate how to make the application smarter by returning different responses based on the incoming request&#39;s path. </p>\n<p>To achieve this, the article introduces the Router class and provides code for creating a new router.rb file. The Router class uses a @routes Hash as its internal data structure to store URL patterns and their corresponding handlers. The article does not provide the complete code for the router, but it sets the stage for future articles in the series that will delve deeper into building a web application without Rails. </p>\n<p>Overall, this article serves as a valuable resource for developers interested in understanding the fundamentals of routing in web applications and building their own router using Ruby.</p>\n"}