{"layout":"article.njk","title":"WWDC 2023: What's New in Core Data","date":"2023-07-04T03:00:00.000Z","formattedDate":"2023-7-4","source_link":"https://betterprogramming.pub/wwdc-2023-whats-new-in-core-data-11f49a8e8dad#beff-c913b1d71a5a","tags":["swift","core-data"],"topics":[{"name":"Swift","slug":"swift"},{"name":"Core Data","slug":"core-data"}],"content":"<p>At WWDC 2023, Apple will be introducing the new data framework SwiftData. However, Core Data, the cornerstone of SwiftData, has also received some enhancements. This article will highlight the new features that Core Data has gained this year.</p>\n<p>One of the notable additions is the introduction of composite attributes. With composite attributes, developers can now encapsulate complex data types in a customized way. Previously, developers had three optional solutions to add latitude and longitude information to a restaurant entity. However, each solution had its own advantages and disadvantages.</p>\n<p>Composite attributes provide developers with a brand new option. By customizing a composite attribute in Xcode&#39;s Data Model Editor, developers can add attributes to the custom composite attribute in a similar way to defining an entity. This allows developers to use any property provided by Core Data for the entity, such as string, double, date, etc. Additionally, developers can also use other pre-defined composite attributes, and nesting is fully supported.</p>\n<p>This enhancement in Core Data offers developers more flexibility and convenience when working with complex data types. It simplifies the process of handling and managing data within the Core Data framework.</p>\n<p>To demonstrate the usage of composite attributes, here&#39;s an example:</p>\n<pre><code class=\"language-swift\">// Define a composite attribute for latitude and longitude\nlet locationAttribute = LocationAttribute()\nlocationAttribute.latitude = 37.7749\nlocationAttribute.longitude = -122.4194\n\n// Assign the composite attribute to a restaurant entity\nlet restaurant = Restaurant()\nrestaurant.name = &quot;Sample Restaurant&quot;\nrestaurant.location = locationAttribute\n</code></pre>\n<p>In this example, a composite attribute called <code>LocationAttribute</code> is defined to store the latitude and longitude information. The composite attribute is then assigned to a restaurant entity, simplifying the process of adding complex data to the entity.</p>\n<p>Overall, the addition of composite attributes in Core Data expands the capabilities of the framework and provides developers with more options for handling complex data types.</p>\n"}