{"layout":"article.njk","title":"Mikochi - A Minimalist Remote File Browser with a Go Backend","date":"2023-06-09T03:00:00.000Z","formattedDate":"2023-6-9","source_link":"https://github.com/zer0tonin/Mikochi","tags":["go"],"topics":[{"name":"Go","slug":"go"}],"content":"<p>Mikochi is a remote file browser that allows users to access and manage files on a remote server through a web interface. It is a minimalist application that is built with a Go backend and can be easily deployed on any server.</p>\n<p>The application provides a simple and intuitive interface that allows users to browse, upload, download, and delete files on the remote server. It also supports file previews, which allows users to view the contents of a file without having to download it.</p>\n<p>Mikochi is built with a Go backend, which makes it fast and efficient. The backend uses the net/http package to handle incoming requests and the html/template package to generate HTML pages. It also uses the os package to access the file system and the path/filepath package to manipulate file paths.</p>\n<p>To deploy Mikochi, users can simply download the binary file from the GitHub repository and run it on their server. The application can be configured using command-line arguments or environment variables.</p>\n<p>Here&#39;s an example of how to run Mikochi on a server:</p>\n<pre><code>$ ./mikochi -port 8080 -root /path/to/files\n</code></pre>\n<p>This command starts the Mikochi server on port 8080 and sets the root directory to /path/to/files.</p>\n<p>Mikochi is a great tool for developers who need to manage files on a remote server. It is lightweight, easy to use, and can be easily customized to meet specific needs. The Go backend also makes it fast and efficient, which is important when dealing with large files or directories.</p>\n<p>In conclusion, Mikochi is a minimalist remote file browser that is built with a Go backend. It provides a simple and intuitive interface for managing files on a remote server and can be easily deployed on any server. Developers who need to manage files on a remote server should definitely check out Mikochi.</p>\n"}