{"layout":"article.njk","title":"VanJS 0.12.0: A Major Release with Polymorphic Binding, SVG/AutoML Support, Readonly Properties, and Performance Optimizations","date":"2023-06-09T03:00:00.000Z","formattedDate":"2023-6-9","source_link":"https://github.com/vanjs-org/van/discussions/53","tags":["javascript"],"topics":[{"name":"JavaScript","slug":"javascript"}],"content":"<p>VanJS, the world&#39;s smallest reactive UI framework, has recently released its major version, VanJS 0.12.0. This release includes the implementation of several long-awaited features, as well as some performance optimizations.</p>\n<p>One of the most significant features introduced in this release is the Polymorphic Binding. This feature allows users to specify both state and non-state property values while building reusable components. For instance, for a reusable Button component, it would be desirable for the Button to accept both static color value and color state. With Polymorphic Binding, this is now possible.</p>\n<p>VanJS 0.12.0 also introduces SVG/AutoML support. This feature enables users to create scalable vector graphics (SVG) and automate machine learning (AutoML) models using VanJS. With this feature, developers can now build more sophisticated and intelligent applications using VanJS.</p>\n<p>Another notable feature of this release is Readonly Properties. This feature allows users to define properties that cannot be modified once set. This is particularly useful for ensuring that certain properties remain constant throughout the lifecycle of a component.</p>\n<p>In addition to these features, VanJS 0.12.0 also includes several performance optimizations. These optimizations include reducing the size of the library, improving the rendering speed, and reducing the memory footprint.</p>\n<p>VanJS is a lightweight and easy-to-use framework that enables developers to build reactive user interfaces quickly. It is particularly useful for building small to medium-sized applications where a full-fledged framework like React or Angular may be overkill.</p>\n<p>To get started with VanJS, developers can simply include the library in their project and start building components using the VanJS API. Here&#39;s an example of how to create a simple Button component using VanJS:</p>\n<pre><code>import { h, render } from &#39;van&#39;;\n\nconst Button = ({ text }) =&gt; {\n  const handleClick = () =&gt; {\n    console.log(&#39;Button clicked&#39;);\n  };\n\n  return h(&#39;button&#39;, { onclick: handleClick }, text);\n};\n\nrender(h(Button, { text: &#39;Click me&#39; }), document.body);\n</code></pre>\n<p>Overall, VanJS 0.12.0 is a significant release that brings several new features and performance improvements to the framework. With its lightweight and easy-to-use API, VanJS is an excellent choice for developers looking to build reactive user interfaces quickly and efficiently.</p>\n"}