{"layout":"article.njk","title":"Node v16.20.1 (LTS) Security Release","date":"2023-06-20T03:00:00.000Z","formattedDate":"2023-6-20","source_link":"https://nodejs.org/en/blog/release/v16.20.1","tags":["nodejs"],"topics":[{"name":"Node.js","slug":"nodejs"}],"content":"<p>Node.js has released version v16.20.1 (LTS) which includes fixes for several CVEs and OpenSSL security advisories. The release also includes updates to c-ares, a library for asynchronous DNS requests.</p>\n<p>CVE Fixes\nThis release includes fixes for the following CVEs:</p>\n<ul>\n<li>CVE-2023-30581: mainModule.<strong>proto</strong> Bypass Experimental Policy Mechanism (High)</li>\n<li>CVE-2023-30585: Privilege escalation via Malicious Registry Key manipulation during Node.js installer repair process (Medium)</li>\n<li>CVE-2023-30588: Process interruption due to invalid Public Key information in x509 certificates (Medium)</li>\n<li>CVE-2023-30589: HTTP Request Smuggling via Empty headers separated by CR (Medium)</li>\n<li>CVE-2023-30590: DiffieHellman does not generate keys after setting a private key (Medium)</li>\n</ul>\n<p>OpenSSL Security Advisories\nThis release also includes updates to OpenSSL, with security advisories released on March 28th, April 20th, and May 30th.</p>\n<p>c-ares Vulnerabilities\nUpdates to c-ares address several vulnerabilities, including GHSA-9g78-jv2r-p7vc, GHSA-8r8p-23f3-64c2, GHSA-54xr-f67r-4pc4, and GHSA-x6mf-cxr9-8q6v. More detailed information on each of the vulnerabilities can be found in the June 2023 Security Releases blog post.</p>\n<p>Code Changes\nThis release also includes several code changes, including updates to c-ares and OpenSSL sources. Notable commits include:</p>\n<ul>\n<li>[5a92ea7a3b] - crypto: handle cert with invalid SPKI gracefully (Tobias Nießen)</li>\n<li>[5df04e893a] - deps: set CARES_RANDOM_FILE for c-ares (Richard Lau) #48156</li>\n<li>[c171cbd124] - deps: update c-ares to 1.19.1 (RafaelGSS) #48115</li>\n<li>[155d3aac02] - deps: update archs files for OpenSSL-1.1.1u+quic (RafaelGSS) #48369</li>\n<li>[8d4c8f8ebe] - deps: upgrade openssl sources to OpenSSL_1_1_1u (RafaelGSS) #48369</li>\n<li>[1a5c9284eb] - doc,test: clarify behavior of DH generateKeys</li>\n</ul>\n<p>Developers using Node.js should update to version v16.20.1 (LTS) to ensure their applications are not vulnerable to the aforementioned CVEs and security advisories. It is also recommended to keep an eye on the June 2023 Security Releases blog post for more detailed information on the vulnerabilities addressed in this release.</p>\n"}