{"layout":"article.njk","title":"React to LiveView for Performance","date":"2023-06-20T03:00:00.000Z","formattedDate":"2023-6-20","source_link":"https://podcast.thinkingelixir.com/156","tags":["elixir","react","liveview"],"topics":[{"name":"Elixir","slug":"elixir"},{"name":"React","slug":"react"},{"name":"LiveView","slug":"liveview"}],"content":"<p>In the latest episode of Thinking Elixir podcast, Tim Gremore shares their experience of migrating a React app to LiveView to solve performance issues. </p>\n<p>When faced with the challenge of displaying hundreds of items on their React app, the app started to stutter and slow down. However, when they tried LiveView, they were able to scale to thousands of items without any issues. The LiveView version was so responsive that users thought it was not working because there was no delay in registering changes.</p>\n<p>LiveView is a feature of the Elixir programming language that allows developers to build reactive, real-time web applications without the need for client-side JavaScript. It enables developers to write server-rendered HTML that automatically updates in response to user actions, without the need for a full page refresh.</p>\n<p>LiveView is gaining popularity among developers due to its ability to improve performance, reduce complexity, and increase productivity. It also offers a more secure and reliable way of building web applications, as all the logic is executed on the server-side.</p>\n<p>In the podcast, Tim shares tips and insights on their journey of migrating from React to LiveView. They also discuss the benefits of using LiveView for performance-critical applications, and how it can help developers build more scalable and responsive web applications.</p>\n<p>In other news related to Elixir, the latest release of the language, Elixir 1.15.0-rc.2, is now available. This release includes several bug fixes and improvements, including enhancements to the Elixir compiler and runtime. Developers can download the latest release from the official Elixir website or GitHub repository.</p>\n<p>As the demand for high-performance web applications continues to grow, technologies like LiveView are becoming increasingly important for developers. With its ability to improve performance, reduce complexity, and increase productivity, LiveView is quickly becoming a popular choice for building real-time web applications. </p>\n<p>Here&#39;s an example of how LiveView works in Elixir:</p>\n<pre><code class=\"language-elixir\">defmodule MyApp.Counter do\n  use Phoenix.LiveView\n\n  def render(assigns) do\n    ~L&quot;&quot;&quot;\n    &lt;div&gt;\n      &lt;h1&gt;Counter: &lt;%= @count %&gt;&lt;/h1&gt;\n      &lt;button phx-click=&quot;increment&quot;&gt;+&lt;/button&gt;\n    &lt;/div&gt;\n    &quot;&quot;&quot;\n  end\n\n  def mount(_params, _session, socket) do\n    {:ok, assign(socket, count: 0)}\n  end\n\n  def handle_event(&quot;increment&quot;, _params, socket) do\n    {:noreply, assign(socket, count: socket.assigns.count + 1)}\n  end\nend\n</code></pre>\n<p>This code defines a simple counter application using LiveView. The <code>render</code> function defines the HTML template for the application, while the <code>mount</code> function initializes the state of the application. The <code>handle_event</code> function handles user events, such as clicking the &quot;+&quot; button, and updates the state of the application accordingly. </p>\n<p>In conclusion, LiveView is a powerful tool for building real-time web applications with high performance and scalability. Developers who are looking to improve the performance of their web applications should consider using LiveView as an alternative to client-side JavaScript frameworks like React.</p>\n"}