{"layout":"article.njk","title":"The Future of GraalVM: Oracle GraalVM","date":"2023-06-20T03:00:00.000Z","formattedDate":"2023-6-20","source_link":"https://vived.substack.com/p/graalvm-ee-is-dead-long-live-oracle","tags":["java","graalvm"],"topics":[{"name":"Java","slug":"java"},{"name":"GraalVM","slug":"graalvm"}],"content":"<p>GraalVM has been making headlines recently, with the announcement of the discontinuation of GraalVM Enterprise Edition (EE) and the focus shifting to Oracle GraalVM. For developers who have been using GraalVM EE, this news may come as a surprise. However, the shift in focus is not entirely unexpected, as the GraalVM license has undergone significant changes over the years.</p>\n<p>Historical background\nTo understand the current state of GraalVM, it is essential to take a look at its historical background. GraalVM has been a popular choice for developers due to its ability to run multiple programming languages on the Java Virtual Machine (JVM). The GraalVM Community Edition (CE) is the open-source version of GraalVM, which is widely used by developers. On the other hand, GraalVM EE was a commercial project that required a commercial Oracle subscription for its use in production environments.</p>\n<p>The shift to Oracle GraalVM\nThe discontinuation of GraalVM EE has led to the focus shifting to Oracle GraalVM. Oracle GraalVM is essentially the same as GraalVM CE, but with additional features and support from Oracle. This means that developers can continue to use GraalVM, but with the added benefits of support from Oracle.</p>\n<p>Benefits of Oracle GraalVM\nOracle GraalVM offers several benefits for developers. Firstly, it provides improved performance and faster startup times for Java applications. This is achieved through the use of Ahead-of-Time (AOT) compilation, which allows Java code to be compiled into native code before runtime. This results in faster startup times and reduced memory usage.</p>\n<p>Secondly, Oracle GraalVM supports multiple programming languages, including Java, JavaScript, Ruby, Python, and R. This means that developers can use a single runtime environment for all their programming needs, which simplifies development and reduces the need for multiple runtime environments.</p>\n<p>Getting started with Oracle GraalVM\nTo get started with Oracle GraalVM, developers can download the latest version from the official website. Once downloaded, they can install it and start using it for their development needs. Additionally, Oracle provides documentation and support for developers who need assistance with using Oracle GraalVM.</p>\n<p>Conclusion\nThe discontinuation of GraalVM EE may have come as a surprise to some developers, but the focus on Oracle GraalVM is a positive move for the future of GraalVM. With improved performance, support for multiple programming languages, and support from Oracle, developers can continue to use GraalVM with added benefits. For developers looking to keep up with the latest news in the industry, Oracle GraalVM is definitely a technology to watch.</p>\n"}