{"layout":"article.njk","title":"FeverPhone: An App that Transforms Smartphones into Thermometers","date":"2023-06-21T03:00:00.000Z","formattedDate":"2023-6-21","source_link":"https://www.washington.edu/news/2023/06/21/an-app-can-transform-smartphones-into-thermometers-that-accurately-detect-fevers/","tags":["frameworks"],"topics":[{"name":"Frameworks","slug":"frameworks"}],"content":"<p>A team of researchers from the University of Washington has developed an app called FeverPhone that can turn smartphones into thermometers without requiring any additional hardware. The app can accurately detect fevers by holding the phone&#39;s screen to a patient&#39;s forehead. This innovation is especially useful during the COVID-19 pandemic, where fever is a common symptom of the virus. </p>\n<p>At-home thermometers can be expensive, and many people only need them a few times a year. In times of sudden demand, such as the early days of the pandemic, thermometers can sell out. FeverPhone is a cost-effective solution that can help people in under-resourced areas who may not have access to vital medical devices. </p>\n<p>The app is easy to use and can be downloaded for free. It is also user-friendly and provides accurate temperature readings. FeverPhone can be a game-changer in telehealth consultations, where patients can take their temperature at home and share the results with their healthcare provider. </p>\n<p>FeverPhone is an excellent example of how technology can be used to improve public health. It is a low-cost solution that can help people in under-resourced areas and provide quick diagnoses to prevent viral spread. </p>\n<p>Developers can learn from this innovation and create similar apps that can help people during a health crisis. The code for FeverPhone is open-source, which means developers can access and modify the code to create their own versions of the app. </p>\n<p>Overall, FeverPhone is a significant development in the healthcare industry, and its impact can be far-reaching. It is a testament to the power of technology and how it can be used to solve real-world problems.</p>\n"}