{"layout":"article.njk","title":"Node package for generating family-friendly usernames","date":"2023-06-26T03:00:00.000Z","formattedDate":"2023-6-26","source_link":"https://old.reddit.com/r/node/comments/14jvk6b/node_package_for_generating_unique_usernames_that/","tags":["nodejs"],"topics":[{"name":"Node.js","slug":"nodejs"}],"content":"<p>The author of a platform that recently gained 1000 users has received feedback to add a feature that requires usernames. They tried using the npm package &quot;unique-username-generator&quot; with the format <code>${adjective}_${noun}</code> but found that many of the generated usernames were questionable or negative, which did not fit the platform&#39;s family-friendly image. </p>\n<p>The author is now searching for a package that generates unique usernames with more positive adjectives. While they could create their own dictionary of words to use with the package, they would prefer to use a package that already includes positive adjectives. </p>\n<p>Fortunately, there are several npm packages available for generating unique and family-friendly usernames. One such package is &quot;friendly-words&quot;, which includes a list of 5,000 common English words that are easy to spell and pronounce. The package allows users to generate random usernames with the format <code>${adjective}_${noun}</code>, or they can use the package&#39;s built-in functions to generate usernames with different formats. </p>\n<p>Here&#39;s an example of how to use &quot;friendly-words&quot; to generate a random username:</p>\n<pre><code class=\"language-javascript\">const friendlyWords = require(&#39;friendly-words&#39;);\n\nconst username = `${friendlyWords.predicates[Math.floor(Math.random() * friendlyWords.predicates.length)]}_${friendlyWords.objects[Math.floor(Math.random() * friendlyWords.objects.length)]}`;\n\nconsole.log(username); // Output: &quot;happy_donkey&quot;\n</code></pre>\n<p>Other npm packages that offer similar functionality include &quot;random-username-generator&quot; and &quot;username-generator&quot;. By using these packages, developers can ensure that their platforms have family-friendly usernames that fit their brand image.</p>\n"}